# 默认的系统监控配置
check_conf_dic = {
    # *********下面是本机监控配置***********
    "server_ip": 'myip',
    # 定义项目名称
    "project_name": "None",
    # 报警联系人多人用;号隔开
    "alert_to_user": "郭萌",
    # 联系电话多人用;号隔开
    "user_tel": "@all",
    # 微信收信人
    "user_wx": "2",
    # 重复报警间隔设置（单位：分钟）
    "alert_again_time": 120,

    # ********监控同名进程个数报警配置***********
    # 监控进程名称(多个用英文;号隔开,留空则不监控)
    "one_prc_num_list": "",
    # 监控进程个数(多个用英文;号隔开,上下对应)
    "one_prc_num_limit": "",
    # 上线持续时间,单位：秒
    "one_prc_num_time": 60,

    # ********监控进程占用cpu使用率报警配置*********
    # 单进程占用CPU使用率进程名(多个用英文;号隔开,留空则不监控)
    "one_prc_cpu_list": "",
    # 单进程占用CPU使用率报警值%(多个用英文;号隔开，上下对应)
    "one_prc_cpu_limit": "",
    # 单进程占用CPU使用率上线持续时间,单位：秒
    "one_prc_cpu_time": 60,

    # *******监控进程占用内存值报警配置*********
    # 下面配置需要监控进程占用内存的程序名(值为空不监控，多个用英文;号隔开。最多不超过30个)
    "one_prc_memory_list": "",
    # 下面配置进程占用内存是报警上线，单位：M (配值上下对应)
    "one_prc_memory_limit": "",
    "one_prc_memory_time": "",

    # *******监控内部端口不通报警配置*********
    # 定义内部端口 (值为no或空则不监控，多个用英文;号隔开。)
    "check_port_nei": "",

    # *******监控cpu使用率报警配置*********
    # 定义cpu报警上线% (值为0则不监控)
    "sys_cpu_limit": 90,
    # 定义cpu使用率上线持续时间,单位：秒
    "sys_cpu_time": 60,

    # *******监控系统IOwait率报警配置*********
    # 定义系统IOwait报警上线% (值为0则不监控)
    "sys_io_wait_limit": 50,
    # 定义系统IOwait率上线持续时间,单位：秒
    "sys_io_wait_time": 60,

    # 定义load报警上线 (值为0则不监控)
    "sys_load_limit": 0,
    # 定义load上线持续时间,单位：秒
    "sys_load_time": 60,

    # *******监控系统网络流量报警配置*********
    # 定义系统网络流量报警上线K/s (值为0则不监控)
    "sys_net_io_limit": 0,
    # 定义系统网络流量上线持续时间,单位：秒
    "sys_net_io_time": 60,

    # *******内存使用率报警配置*********
    # 定义内存报警上线% (值为0则不监控)
    "sys_v_memory_limit": 90,
    # 定义内存使用率上线持续时间,单位：秒
    "sys_v_memory_time": 60,

    # 定义swap内存报警上线% (值为0则不监控)
    "sys_swap_memory_limit": 90,
    # 定义swap内存使用率上线持续时间,单位：秒
    "sys_swap_memory_time": 60,

    # *******监控系统进程数报警配置*********
    # 定义系统进程数报警上线 (值为0则不监控)
    "sys_prc_num_limit": 500,
    # 定义系统进程数上线持续时间,单位：秒
    "sys_prc_num_time": 60,

    # *******监控磁盘空间报警配置*********
    # 定义检测磁盘空间低于报警值,单位：M (值为0则不监控)
    "drives_limit": 5000,
    # 特殊磁盘监控定义(可写多个，用英文;号隔开，上下对应.留空则不监控.windows书写格式：C:/;D:/)
    "special_drives_list": "/boot",
    "special_drives_limit": "20",
    # 定义挂载目录inode占用百分比
    "drives_inode_limit": 0,

    # *******其他*********
    # 循环一轮结束后休息时间，单位：分钟
    "sleep_timers": 1,
    # log记录方式：0只记录报警，1详细监控内容
    "log_way": 1,

    # *********下面是邮箱配置***********
    # 是否发报警邮件:1发送，0不发送
    "alert_mail_way": 1,
    # 接收邮件地址 (多人用英文;隔开)
    "to_email": 'meng.guo@ema.games'
}